cheon7886/ArduinoBox/hardware/Rokit/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

SmartInventor.name = Rokit-SmartInventor 
SmartInventor.upload.protocol=arduino
SmartInventor.upload.maximum_size=14336
SmartInventor.upload.speed=57600
SmartInventor.upload.using=USBasp
SmartInventor.bootloader.low_fuses=0x3f
SmartInventor.bootloader.high_fuses=0xc0
SmartInventor.bootloader.extend=0xff

SmartInventor.bootloader.path=SmartInventor
SmartInventor.bootloader.file=boot_SmartInventor.hex

SmartInventor.bootloader.unlock_bits=0x3f
SmartInventor.bootloader.lock_bits=0x0ff

SmartInventor.build.mcu=atmega16
SmartInventor.build.f_cpu=16000000L

SmartInventor.build.core=atmega16
SmartInventor.build.variant=SmartInventor

##############################################################

SmartServoBox.name = Rokit-SmartServoBox 
SmartServoBox.upload.protocol=arduino
SmartServoBox.upload.maximum_size=14336
SmartServoBox.upload.speed=57600
SmartServoBox.upload.using=USBasp
SmartServoBox.bootloader.low_fuses=0x3f
SmartServoBox.bootloader.high_fuses=0xc0
SmartServoBox.bootloader.extend=0xff

SmartServoBox.bootloader.path=SmartServoBox
SmartServoBox.bootloader.file=boot_SmartServoBox.hex

SmartServoBox.bootloader.unlock_bits=0x3f
SmartServoBox.bootloader.lock_bits=0x0ff
SmartServoBox.build.mcu=atmega16
SmartServoBox.build.f_cpu=16000000L

SmartServoBox.build.core=atmega16
SmartServoBox.build.variant=SmartServoBox

##############################################################

ArduBox128.name = Rokit-ArduBox128
ArduBox128.upload.protocol=arduino
ArduBox128.upload.maximum_size=126976
ArduBox128.upload.speed=19200
ArduBox128.upload.using=USBasp
ArduBox128.bootloader.low_fuses=0x3e
ArduBox128.bootloader.high_fuses=0x98
ArduBox128.bootloader.extend=0xff
ArduBox128.bootloader.path=atmega128
ArduBox128.bootloader.file=atmega128.hex
ArduBox128.bootloader.unlock_bits=0x3f
ArduBox128.bootloader.lock_bits=0x0f
ArduBox128.build.mcu=atmega128
ArduBox128.build.f_cpu=16000000L
ArduBox128.build.core=atmega128
ArduBox128.build.variant=ArduBox128

##############################################################

Ardu-X100.name = Rokit-Ardu-X100 
Ardu-X100.upload.protocol=arduino
Ardu-X100.upload.maximum_size=14336
Ardu-X100.upload.speed=57600
Ardu-X100.upload.using=USBasp
Ardu-X100.bootloader.low_fuses=0x3f
Ardu-X100.bootloader.high_fuses=0xc0
Ardu-X100.bootloader.extend=0xff

Ardu-X100.bootloader.path=Ardu-X100 
Ardu-X100.bootloader.file=boot_Ardu-X100.hex

Ardu-X100.bootloader.unlock_bits=0x3f
Ardu-X100.bootloader.lock_bits=0x0ff
Ardu-X100.build.mcu=atmega16
Ardu-X100.build.f_cpu=16000000L

Ardu-X100.build.core=atmega16
Ardu-X100.build.variant=Ardu-X100 

##############################################################